Австралия/src/AccumulationRegisters/AdvanceHolders/AdvanceHolders.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>AdvanceHolders</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.ExpenseReport</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.CashVoucher</types>
      <types>DocumentRef.PaymentReceipt</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/AdvanceHolders/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
	 OR Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	AccumulationRegisterAdvanceHolders.LineNumber AS LineNumber,
	|	AccumulationRegisterAdvanceHolders.Company AS Company,
	|	AccumulationRegisterAdvanceHolders.PresentationCurrency AS PresentationCurrency,
	|	AccumulationRegisterAdvanceHolders.Employee AS Employee,
	|	AccumulationRegisterAdvanceHolders.Currency AS Currency,
	|	AccumulationRegisterAdvanceHolders.Document AS Document,
	|	AccumulationRegisterAdvanceHolders.Amount AS SumBeforeWrite,
	|	AccumulationRegisterAdvanceHolders.Amount AS AmountChange,
	|	AccumulationRegisterAdvanceHolders.Amount AS AmountOnWrite,
	|	AccumulationRegisterAdvanceHolders.AmountCur AS AmountCurBeforeWrite,
	|	AccumulationRegisterAdvanceHolders.AmountCur AS SumCurChange,
	|	AccumulationRegisterAdvanceHolders.AmountCur AS SumCurOnWrite
	|INTO RegisterRecordsAdvanceHoldersChange
	|FROM
	|	AccumulationRegister.AdvanceHolders AS AccumulationRegisterAdvanceHolders");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsAdvanceHoldersChange", False);
	
EndProcedure

#EndRegion

#EndIf
